Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: There are two buttons of note here however, as they are not present anywhere else in the GameMaker: Studio GUI:
zh_cn: 需要注意下面两个按钮，他们并不存在于 GameMaker: Studio GUI 的其他位置:

source: There is a drop-down window here where you can select from a default list of layouts, or you can click the box and input your own value.
zh_cn: 在下拉菜单中你可以选择一个布局的默认列表，或者你可以点击输入框输入你需要的值。

source: There is a small cost involved in registering for this account and you will need to have a valid bank account and credit facilities to be able to monetize any apps that you submit to the store.
zh_cn: 注册这个账号是为了获取您的有效的银行账户及信用许可以便使得您可以通过您的应用程序赚钱。

source: There is a stop button too, so you can stop the preview at any time.
zh_cn: 也有停止按钮，所以你可以在任何时候停止预览。

source: There is also a tool-bar button for this command and you can even open a game by dragging the file into the actual GameMaker: Studio window.
zh_cn: 工具栏上也有相应的按钮，甚至可以拖动文件到 GameMaker: Studio 窗口打开。

source: There is also a tool-bar button for this command, but both will methods will take you back to the "Welcome" screen where you can create a new project.
zh_cn: 这两种情况都会回到欢迎屏幕创建新项目。

source: There is one final feature of the GameMaker: Studio GUI which is worth noting, and that is the search box that can be found to the top right of the IDE: If you are looking for more detailed information on a subject and the manual doesn't cover it (there are many things outside of the scope of this document) or you think there may be a bug, then you can type a few keywords here and it will search the YoYo Games Knowledge Base then open a tab in your browser showing you a list of the topics that are available.
zh_cn: 这是 GameMaker: Studio GUI 最后一个值得注意的地方，搜索框，可以在 IDE 的右上角找到: 如果你正在寻找更详细的信息，而主题和手册里都没有相关内容 (有很多此文档之外的东西) 或者你认为这儿可能是个 bug，那么你就可以在这里输入关键字搜索 YoYo Games 知识库，然后在浏览器的新打开的选项卡中就会列出你想要查询的相关主题列表。

source: Therefore if there is the possibility that the instance could be destroyed, deactivated, or otherwise removed from the room while using this method, you should always check before hand using the instance_exists() function or the instance_number() function.
zh_cn: 因此，当使用这个方法时如果有可能会出现实例销毁、无效化，或者从房间里删除的情况，你应该 始终检测实例的存在。使用 instance_exists() 函数或者 instance_number() 函数可以做到这一点。

source: Therefore we now need to draw the surface to the screen in the Draw GUI event like this:
zh_cn: 因为现在需要在 Draw GUI 事件中，像这样绘制这个表面到屏幕上：

source: Therefore, if you have something like this:
zh_cn: 因此，如果代码这样写：

source: These are all perfectly valid ways of reading, changing and setting variables in other instances, and work because the point is actually an operator.
zh_cn: 读取、改变或设置其它实例的变量，这些都是完美有效的方法，指针点“.”实际上就是一个运算符。

source: These are created from the Global Game Settings Audio Groups Tab and are used to to group audio assets together for easier memory management and volume control.
zh_cn: 这需要在 Global Game Settings (游戏全局设置) 的 Audio Groups Tab (音频组选项卡) 设置，把音频资源放在一组更容易管理内存和控制音量。

source: These are designed as an introduction to using GameMaker: Studio and it is recommended that new users look them over before starting any new projects of their own.
zh_cn: 这些设计用来介绍如何使用 GameMaker: Studio 和创建新工程之前看看应该如何开始。

source: These are designed to give you flexibility in your code, and will permit you to create more functional and dynamic arrays when making your games.
zh_cn: 允许你在代码设计中更为灵活，在制作游戏中更好的创建功能强大的动态数组。

source: These are usually large images that are used as backgrounds (or foregrounds) for the rooms in which the game takes place, but they can also be large images composed of many smaller ones called tiles which you can then place individually in your room to create complex visual designs for levels with far less processing overhead than you would get with objects and sprites.
zh_cn: 通常用大图像作为房间的背景。但它们也可以是由许多名为 tiles (磁贴) 的小图像组成，它们只需要更小的开销。你会得到比物体和精灵更复杂的视觉设计。

source: These arguments are stored in the built in variables argument0, argument1, ..., etc... up to argument15.
zh_cn: 这些函数储存在 内置 变量 argument0、 argument1、 ……等等里面，最大 argument15。

source: These buttons are:
zh_cn: 这些按钮是：

source: These can be found from the Tutorials tab on the start-up splash screen, and cover all basic functionality.
zh_cn: 这些可以在启动屏幕的 Tutorials (教程) 选项卡中找到它们，它们涵盖了所有的基本功能。

source: These demos are pulled from an RSS feed, so you will need an active internet connection to access them.
zh_cn: 这些演示来自于RSS feed的推送，所以你需要联网来访问它们。

source: These files are much smaller than a wave file would be but have a small CPU overhead as they have to be decoded before being played, hence the limit of only one MP3 file being played at time (however, you can have multiple music tracks in your game, and you would just switch between them when necessary).
zh_cn: 这些文件比 wave 文件小得多，但是有小的 CPU 消耗，因为它们在播放前会解码，因此同时只能播放一个 MP3 文件(不过，在你的游戏中可以有多个音乐曲目以便在需要时切换着使用)。

source: These files should be removed or changed before testing!
zh_cn: 这些文件应该在测试前被删除或替换！

source: These function can be used to sync data to different cloud services.
zh_cn: 这些函数可以用来将数据同步到不同的服务器上。

source: These functions are explained on the following pages:
zh_cn: 下面的网页将详细介绍这些函数：

source: These functions are specific for creating and manipulating surfaces, but to actually draw them to the screen you should be using the specific draw functions that can be found in the section on Drawing Surfaces.
zh_cn: 这些函数是专门用于创建和调整表面，但要真正绘制到屏幕上，你应该使用特定的绘制函数，可以在 Drawing Surfaces这一节找到相关内容。

source: These functions are:
zh_cn: 这些函数是：

source: These notes outline all the bug fixes and changes that have been incorporated into the program and tell you which version you are currently using.
zh_cn: 这些日志记录了bug修复和变化，告诉你正在使用的版本。

source: These numbers are always larger than or equal to 100000, and such a number can also be used as the left-hand side of the point.
zh_cn: “id值”总是大于或等于100000，这些数值也可以用于点“.”的左手边。

source: These options include source control integration, project configurations, advanced debugging and a number of extra tools for changing and manipulating the game assets (please note that the availability of some of these advanced tools will depend on the version of GameMaker: Studio that you currently use).
zh_cn: 这些选项包括源代码管理集成，项目配置，先进的调试以及许多改变和操作游戏资产的额外工具 (请注意一些高级工具的可用性取决于你当前在用的 GameMaker: Studio版本)。

source: These options include source control integration, project configurations, advanced debugging and a number of extra tools for changing and manipulating the game assets, although the exact selection of tools available to you will depend on the version of GameMaker: Studio that you are using (more information on versions can be found here).
zh_cn: 这些设置选项包括代码控制、项目配置、高级调试和一些额外的改变、操作游戏资源的工具，尽管如此，你需要根据你使用的GameMaker: Studio 版本选择可用的工具（更多版本的信息可以在这里找到）。

source: These points are added automatically to the point list beneath the path name and you can also click on a point in the list to select it in the main window.
zh_cn: 这些路径点会被自动添加进位于路径名下方的路径点列表 ，并且你可以在这里点击以选择相应的点。

source: These project files contain all the information relevant to your current project (including resources, extensions, game information etc...) which can then be imported again into GameMaker: Studio as a complete project in the future.
zh_cn: 这些工程文件包括 所有 当前游戏的信息 (包括资源、扩展、游戏信息等)，然后可以再次导入到 GameMaker: Studio 。

source: These settings will affect how the sound is exported for the target platform, and GameMaker: Studio will automatically convert your sound files for you - you simply control the final quality of those sounds when converted.
zh_cn: 这些设置将会影响声音输出到目标平台 GameMaker: Studio 将会自动转换你的音频文件。

source: These sounds are smaller on disc, but will have a slight CPU overhead due to the need to be uncompressed before being played, so you should keep that in mind if you wish to use compression in an already CPU intensive game.
zh_cn: 这些文件占用空间较小，但是CPU开销较大，请自行取舍。

source: These targets require a Windows 8 OS to run (and for testing), and this can be the main OS or a sub-OS that you can dual boot with Windows 7 (or any other OS you choose to use), however you cannot create a final application for Windows 8 outside of that OS.
zh_cn: 这些目标需要一个 Windows 8 操作系统来运行 (和测试)。

source: These tutorials contain many sprites and graphics which are designed as "place holders" to get you going but they are not for use in any finished product.
zh_cn: 这些教程包括许多精灵和图形您可以直接使用。但是他们 not 能使用在任何成品里。

source: These will all be stored in a folder in the location (and with the name) of your choice.
zh_cn: 这些文件都将被储存在你选择的文件夹里。

source: They are, basically, little windows into your game world that enable you to show the player parts of a room, either scaled or 1:1, and as such they are essential when your game room is larger than the display size.
zh_cn: 视野，基本上是进入游戏世界的小窗口，它们可能是展示房间的一部分，也可能是与房间大小1:1的缩放，因此在房间比显示器更大时视野是必须的。

source: They can be given behaviors and they can react to certain events as well as to each other, and most of the things you see in a game are based on objects and their interactions.
zh_cn: 你可以赋予它们行动，它们也可以对一些事件做出反应，就像你看到的大多数游戏中它们之间的相互作用。

source: They have been split into different groups of associated functions and, where necessary, have been cross referenced with related functions and sections.
zh_cn: 它们已被分成相互关联的不同组别，并在有需要的地方，交叉引用了相关的函数和章节。

source: They have been split into different groups of associated functions and, where necessary, have been cross-referenced with related functions and sections.
zh_cn: 它们已被分成相互关联的不同组别，并在有需要的地方，交叉引用了相关的函数和章节。

source: They will also react to the player using the actions placed in any keyboard or mouse events.
zh_cn: 它们也会触发键盘事件或鼠标事件。

source: Think of an object as the blueprint, and the instance as a manifestation of that blueprint.
zh_cn: 物体作为蓝本，则实例是蓝图。

source: Think of it as an extra dimension to our container, as it now has height and width whereas the 1D array only has height.
zh_cn: 想象它是容器的另外一个维度，一个高度 和 一个宽度，而1D数组只有高度。

source: Third, you should try to draw to surfaces in the draw event.
zh_cn: 第三，你应该尽可能的在绘制事件中向表面层绘制内容。

source: This read only variable is only valid in the Draw Event and returns the current view being rendered.
zh_cn: 这个 只读 变量只在Draw Event 中有效，并返回当前被渲染的视野。

source: This ID can then be used to cancel the notification using the function push_cancel_local_notification().
zh_cn: 使用这个ID可以通过调用push_cancel_local_notification()来取消通知。

source: This Windows only function can be used to change the vertical synchronisation method at runtime.
zh_cn: 这个只用于 Windows 的函数可以用于在运行时改变垂直同步方法。

source: This Windows only function can be used to get the current vertical synchronisation method at runtime.
zh_cn: 这个只用于 Windows 的函数在运行时获取当前垂直同步的方法。

source: This Windows only function permits you to choose one of various different ways of handling the game geometry vertex buffer, some of which may work better on different machines.
zh_cn: 这个只用于 Windows 的函数允许你选择多个不同的处理游戏几何顶点缓冲区的方法中的一个，它们中的一些在不同的机器上可能表现得更好。

source: This Windows only function permits you to find out the current method for handling the game geometry vertex buffer.
zh_cn: 这个只用于 Windows 的函数，允许你找出当前处理游戏几何顶点缓冲区的方法。

source: This application is a platform for distributing your games and for playing those made by others.
zh_cn: 这个是发布游戏以及玩其它的人制作的游戏的一个平台。

source: This bar at the bottom shows the x and y coordinates of the mouse in the path editor, as well as the area of the room visible in the path editor window.
zh_cn: 底部的信息栏显示了鼠标在编辑器中的x y坐标，以及可视范围的坐标。

source: This button can be used to cancel the compilation of your games to the target module, or (on certain targets only) to stop the game while it is running after it has been compiled.
zh_cn: 这个按钮可以用来取消你的游戏编译目标模块，或者 (只在一定的目标中) 停止运行游戏。

source: This can also be done in the property form for the resource, by right-clicking the resource with the mouse and selecting "rename" from the pop-up menu, or by simply clicking the resource again and typing in the new name.
zh_cn: 也可以通过右键菜单或者单击名字实现。

source: This can be a global or instance scope variable, a built in variable or even an array or data structure.
zh_cn: 追踪的内容可以是一个全局或实例范围的变量，一个内置的变量，甚至数组或数据结构。

source: This can be achieved by creating a separate sprite and then assigning that to be used as the collision mask for the object.
zh_cn: 这可以通过创建一个单独的精灵并且指定为物体的碰撞遮罩。

source: This can be an installer, a stand-alone *.exe or a *.zip.
zh_cn: 可以是一个安装包、一个独立的 *.exe 程序或者 *.zip 压缩包。

source: This can be done easily by loading the game into GameMaker: Studio and then choosing the Steam Workshop compile target and hit the Create Executable just as you would when you originally created the game.
zh_cn: 可以很轻松地在 GameMaker: Studio 加载游戏并选择 Steam Workshop 编译目标并点击 Create Executable 按钮创建游戏。

source: This can be set in the Global Game Settings Windows tab or with the function display_set_windows_vertex_buffer_method(), and will return one of the following constants:
zh_cn: 这个可以在全局游戏设定中或者使用函数 display_set_windows_vertex_buffer_method()设置，然后返回下面的一个常量：

source: This can be set in the Global Game Settings Windows tab too, and will affect performance to different degrees depending on the machine.
zh_cn: 这个可也可以在全局游戏设定的 Windows 选项卡中设置，根据不同的机器将会有不同的性能表现。

source: This can be used to unsubscribe the selected game from the player simply by clicking on it, which will turn the button into a green Subscribe button.
zh_cn: 可以用来 取消订阅 选定的游戏，只需要点击它，就会重新变成绿色的 订阅 按钮。

source: This can be used to test whether a saved window position is going to be visible or not (the user may have disconnected an external monitor or moved the window off screen which left the window position that was saved as not being valid), for example.
zh_cn: 这个可以用来测试是否一个保存的窗口位置即将显示或隐藏（用户可能已经断开与外部监视器的连接，或者窗口移出了屏幕，造成了窗口位置保存的是一个无效值），比如下面的例子。

source: This can be very useful to avoid typing out the same code multiple times, or for using arrays, or for counting through a number of operations etc...
zh_cn: 这对于规避键入多次相同的代码、或者使用数组、又或者一些操作中的计数等等是非常有效的。

source: This can increase your games performance by at least two or three times, especially on logic-heavy games, and gives an incredible overall boost to performance, ideal for those larger or CPU intensive games.
zh_cn: 这可以增加至少两到三倍的游戏性能，尤其是一些逻辑复杂的游戏，更是能获得一个难以置信的整体提升，非常适合那些较大、十分消耗 CPU 的游戏。

source: This can now be used as follows in another event of the controller object (an alarm for example, or a key press event):
zh_cn: 下面的代码可以在控制器的另外一个事件中使用（比如计时器，或者按键事件）。

source: This caption appears at the top of the window, beside the game icon, when the game is not in full screen mode.
zh_cn: 当游戏不是全屏模式，标题出现在窗口顶部游戏图标的旁边。

source: This code will now draw the surface that we have created from the view stretched to fill the entire GUI layer.
zh_cn: 代码现在拉伸绘制我们创建的表面至整个GUI 层。

source: This code will run after the create event of the object and is specific to the instance that you add it to.
zh_cn: 实例创建时事件在对象创建时事件之 后执行。

source: This colour represents that which will be used for those areas of the game window that are not occupied by any views.
zh_cn: 这个颜色表示的游戏窗口内视野间隙的背景颜色。

source: This document is divided into three parts with the aim of getting you introduced to the interface and basic workings of GameMaker: Studio before going on to more advanced usage and the functions available through GML (the GameMaker Language).
zh_cn: 这个文档分为三个部分，先是介绍了界面和GameMaker: Studio 的基础使用，然后是高级应用，以及可用函数，也就是 GML (the GameMaker Language)。

source: This drop-down menu allows you to choose which device to target when compiling and testing your game.
zh_cn: 此下拉菜单可以用选择的生成方式编译和测试你的游戏。

source: This extremely useful for doing repetitive tasks that would involve multiple lines of code in any other way, and is commonly used as a counter for evaluating arrays, or drawing things.
zh_cn: 处理包含很多行代码的重复任务极其 有用，通常用来数组计数，或者绘制。

source: This first button will open the Steam Player where you can play any games you have subscribed to or uploaded to the Steam Workshop.
zh_cn: 第一个按钮会打开 Steam Player，你可以在 Steam Workshop 订阅或上传任何游戏。

source: This flexibility is one of the main reasons why "for" loops are so important in programming.
zh_cn: 这种灵活性也是“for”循环在编程中如此重要的原因。

source: This function Resets the display settings to the ones that were set when the game was started, but also allows you to change the current level of full screen anti-aliasing being used and whether to use vertical synchronisation.
zh_cn: 这个函数将游戏开始时显示器的一些设置重置为某些值，也允许更改全屏抗锯齿的等级以及是否使用垂直同步。

source: This function allows you to attach a surface to a canvas element that already exists in your web page, meaning that you can effectively split up portions of your game to be drawn at various different places within the page.
zh_cn: 这个函数允许你为已经存在网页上的canvas元素附著一个表面图层，意味着可以有效的分割游戏的部分页面，绘制到页面内的不同地方。

source: This function can be used to add a given value (real or string) to all the values of the cells found within the defined area of a grid.
zh_cn: 这个函数可以被用于向一个栅格中一个确定区域内所有单元格的数值中叠加一个被给定的值（实数或字符串）。

source: This function can be used to add a given value (real or string) to all the values of the cells found within the defined disk area of a grid.
zh_cn: 这个函数可以被用于向一个栅格中一个确定圆盘区域内所有单元格的数值中叠加一个被给定的值（实数或字符串）。

source: This function can be used to add a given value (real or string) to the value of the given cell within the grid.
zh_cn: 这个函数可以被用于向一个栅格的被给定单元格的值叠加一个给定的值（实数或字符串）

source: This function can be used to add all the values of all the cells found within the source area of a grid to the values within the destination grid, as illustrated below: NOTE: You can also use this function on the same grid to add values from one region of the grid to those stored in another (see code example below).
zh_cn: 这个函数能被用于去把从源栅格中区域内找到的值叠加给一个靶栅格，正如下方插图所示 注意： 你也能对同一栅格使用这个函数来把一片区域内的值叠加给另一片区域（详见下方代码）。

source: This function can be used to clear a given ds_grid to a specific value.
zh_cn: 这个函数可以被用于用一个特定的数值清空一个被给定的栅格结构。

source: This function can be used to clear the entire screen (with no alpha blend) to the given colour, and is only for use in the draw event of an instance (it will not show if used in any other event).
zh_cn: 这个函数用指定颜色来填充（清空）整个屏幕（没有透明度设定），它仅能用于实例的draw事件（用于其它事件时不发挥作用）。

source: This function can be used to clear the entire screen with a given colour and the alpha component of the destination is set to the value you have set - this function does not do any blending as it works but any subsequent blend operations can be set up to use the destination alpha that you have set.
zh_cn: 这个函数可以用指定的颜色和透明度填充整个屏幕，屏幕原有图像的透明度保持不变 - 这个函数 不 会对原有图像的透明度与混合模式做任何修改。随后你可以再次修改其混合操作。

source: This function can be used to get the colour of a specific pixel from a surface, using the local coordinates of the surface where (0,0) is the top left corner.
zh_cn: 此函数使用局部坐标，可用于从一个表面获取特定像素的颜色，其中（0,0）是表面层的左上角。

source: This function can be used to maximise the GUI layer and set it to be scaled and offset in relation to the screen dimensions, rather than the default application surface position and dimensions.
zh_cn: 这个函数最大化GUI层，相对于屏幕尺寸进行缩放和偏移设置，而不是相对于默认的应用表面层的位置和尺寸。

source: This function can be used to set a local notification to be shown on a given date at a given time.
zh_cn: 此函数用于设置一个给定时间日期的本地通知。

source: This function can be used to set a maximum window height for your game.
zh_cn: 这个函数可以给游戏设置一个窗口的最大高度。

source: This function can be used to set a maximum window width for your game.
zh_cn: 这个函数可以给游戏设置一个窗口的最大宽度。.

source: This function can be used to set a minimum window height for your game.
zh_cn: 这个函数可以给游戏设置一个窗口的最小高度。

source: This function can be used to set a minimum window width for your game.
zh_cn: 这个函数可以给你的游戏设置一个最小窗口宽度。

source: This function can set the background colour of the game window.
zh_cn: 这个函数可以设置游戏窗口的背景颜色。

source: This function cancel the given push notification.
zh_cn: 这个函数将会取消已有的推送通知。

source: This function has no effect on any other device.
zh_cn: 这个函数对移动设备无效。

source: This function is essential when working with surfaces due to their volatile nature.
zh_cn: 由于表面图层的不稳定性，在使用到表面时，这个函数还是有必要的。

source: This function is for use with the Shader Functions and sets the MRT (0 - 3) for native level shaders (DX9, DX11, OpenGL).
zh_cn: 这个函数在 着色器函数中使用，在本地可用的着色器 (DX9, DX11, OpenGL)中设置 MRT (0 - 3)输出目标。

source: This function is really only useful for extension writers who need the window handle to call Win32 API's in DLL code.
zh_cn: 当他们需要使用window handle 在DLL代码中调用 Win32 API的时候，这个函数对于插件作者非常有用。

source: This function is used to create a surface and will return the index of the surface which should be stored in a variable for future function calls.
zh_cn: 这个函数被用来创建一个表面图层，而且将会返回这个表面的索引地址，这个索引应该储存在一个变量上，将来可以调用它。

source: This function returns a special pointer for the surface texture.
zh_cn: 这个函数返回表面层纹理的特殊 指针 。

source: This function returns the amount of blue used to make the given colour, with the value being between 0 and 255, where 0 is no blue and 255 is all blue.
zh_cn: 这个函数返回给定颜色的蓝色值，这个值在0到255之间，0代表不含有蓝色，255代表100%的蓝色。

source: This function returns the amount of green used to make the given colour, with the value being between 0 and 255, where 0 is no green and 255 is all green.
zh_cn: 这个函数返回给定颜色的绿色值，这个值在0到255之间，0代表不含有绿色，255代表100%的绿色。.

source: This function returns the amount of red used to make the given colour, with the value being between 0 and 255, where 0 is no red and 255 is all red.
zh_cn: 这个函数返回给定颜色的红色值，这个值在0到255之间，0代表不含有红色，255代表100%的红色。

source: This function returns the background colour of the game window.
zh_cn: 这个函数返回游戏窗口的背景颜色。

source: This function returns the caption of the window (this is the text that appears on the top of the window, beside its icon) and by default this shows the caption of the room you're currently in.
zh_cn: 此函数返回窗口的标题（窗口顶部图标旁边出现的标题文字），默认显示的是当前房间的标题。

source: This function returns the current value of the draw alpha, which will range between 0 (fully transparent) and 1 (fully opaque).
zh_cn: 这个函数返回当前的绘制透明度值，这个数值的范围是从0（完全透明）到1（完全不透明）。

source: This function returns the direction of a vector formed by the specified components [x1,y1] and [x2,y2] in relation to the fixed x/y coordinates of the room.
zh_cn: 这个函数返回由特定的相对于房间的x/y坐标组件(x1,y1)和(x2,y2)形成的一个向量的方向。

source: This function returns the x-coordinate of the mouse with respect to all the active views and returns the same value mouse_x.
zh_cn: 这个函数返回相对于所有激活视野的鼠标x坐标（并且返回与 mouse_x相同的值）。

source: This function returns the y-coordinate of the mouse with respect to all the active views and returns the same value mouse_y.
zh_cn: 这个函数返回相对于所有激活视野的鼠标y坐标（并且返回与 mouse_y相同的值）。

source: This function returns whether the game window is in fullscreen mode (true) or not (false).
zh_cn: 这个函数返回游戏窗口是否是全屏模式(为真)，或者不是 (为假)。

source: This function sets the angular damping value of a fixture.
zh_cn: 这个函数 sets the angular damping value of a fixture.

source: This function should not be used very often as it is extremely slow and may cause a pause in your game.
zh_cn: 此函数建议 不要频繁使用，因为它是极其缓慢，并且可能导致游戏脱帧。

source: This function simply returns the height, in pixels, of the indexed surface.
zh_cn: 这个函数简单的返回索引表面的像素高度。

source: This function simply returns the width, in pixels, of the indexed surface.
zh_cn: 这个函数简单的返回索引表面的像素宽度。

source: This function simply takes the image from one surface and copies it onto another one at the specified local position within that surface (where the (0,0) position is the top left corner of the destination surface).
zh_cn: 这个函数简单的让图像从一个表面图层复制到另外一个表面特殊的位置（(0,0)表示在表面图层的左上角）。

source: This function will commit a file to the chosen cloud service for storage.
zh_cn: 这个函数将提交一个文件到所选云服务用于存储。

source: This function will commit a string to the chosen cloud service for storage.
zh_cn: 该函数将提交一个字符串到所选的云服务用于存储。

source: This function will get the dpi of the device display along the x axis (this value is also dependant on the orientation of the device).
zh_cn: 这个函数将获取设置显示器x轴的dpi（这个值也依赖设备的方向）。

source: This function will get the dpi of the device display along the y axis (this value is also dependant on the orientation of the device).
zh_cn: 这个函数将获取设置显示器y轴的dpi（这个值也依赖设备的方向）。
